app/Helpers/GlobalFunctions.php

select * from `menu_action_rol` where `menu_action` = '70' and `rol_id` = 1
---
function checkExtraPermits($id, $user) {
    $edit = DB::table('menu_action_rol')->where('menu_action', '=', $id)->where('rol_id', '=', \Auth::user()->role_id)->get();