app/Http/Controllers/MassivesVinculationController.php

update `sales` set `status_id` = 25, `sales`.`updated_at` = '2021-04-09 00:49:33' where `sales_type_id` = 7 and `status_id` in (22)
update `sales` set `status_id` = 34, `sales`.`updated_at` = '2021-04-09 00:49:33' where `sales_type_id` = 7 and `status_id` in (20, 36)
---
public function index(request $request) {
//    $collection = (new FastExcel)->import(public_path('ramos.xlsx'));
//    foreach($collection as $c){
//        $pro = new \App\products();
//        $pro->status_id = 2;
//        $pro->segment = $c['RAMODES'];
//        $pro->productodes = $c['RAMODES'];
//        $pro->productoid = 325;
//        $pro->ramodes = $c['RAMODES'];
//        $pro->ramoid = $c['RAMOID'];
//        $pro->agency_id = 32;
//        $pro->canalplanid = 1;
//        $pro->save();
//
//        $pbc = new \App\product_channel();
//        $pbc->channel_id = 19;
//        $pbc->product_id = $pro->id;
//        $pbc->status_id = 2;
//        $pbc->agency_id = 32;
//        $pbc->canal_plan_id = 1;
//        $pbc->agency_ss_id = 1;
//        $pbc->agent_ss = 1;
//        $pbc->ejecutivo_ss = 'DIEGO ERAZO';
//        $pbc->ejecutivo_ss_email = 'diego.erazo@segurossucre.fin.ec';
//        $pbc->save();
//    }
    //Update Sale status to ID 37
  \App\sales::where('sales_type_id',7)
            ->whereIn('status_id',[22])
            ->update(['status_id' => 25]);
  \App\sales::where('sales_type_id',7)
            ->whereIn('status_id',[20,36])
            ->update(['status_id' => 34]);

    //Update Sale status to ID 34
    \App\sales::where('sales_type_id',7)
            ->whereIn('status_id',[20,36])
            ->update(['status_id' => 34]);